[
    "What do you call a snowman with a six-pack? An abdominal snowman.",
    "What do Santa's elves learn at school? The elf-abet.",
    "What do you get if you cross Santa with a detective? Santa Clues!",
    "How does Good King Wenceslas like his pizzas? Deep pan, crisp, and even.",
    "What do you call a cat in the desert? Sandy Claws.",
    "Why was the turkey in the pop group? Because he was the only one with drumsticks!",
    "What do snowmen wear on their heads? Ice caps.",
    "What do you get if you cross a bell with a skunk? Jingle Smells.",
    "What do you call a snowman with a sun tan? A puddle.",
    "Why did Santa's helper see the doctor? Because he had low \"elf\" esteem!",
    "What do you call an old snowman? Water.",
    "What do snowmen eat for breakfast? Ice Krispies.",
    "How do you know if Santa is really a werewolf? He has Claus.",
    "Why did the scarecrow win an award? Because he was outstanding in his field!",
    "What did one snowman say to the other snowman? Can you smell carrots?",
    "What do you get if you cross a vampire and a snowman? Frostbite.",
    "What's a dog's favorite carol? Bark, the Herald Angels Sing.",
    "What does Santa do with out-of-shape elves? Sends them to an elf Farm.",
    "Why did no one bid for Rudolph and Blitzen on eBay? Because they were two deer!",
    "What did Adam say on the day before Christmas? \"It's Christmas, Eve!\"",
    "Why don't you ever see Santa in hospital? Because he has private elf care!",
    "What do you call a bunch of chess players bragging about their games in a hotel lobby? Chess nuts boasting in an open foyer.",
    "What do you call a kid who doesn't believe in Santa? A rebel without a Claus.",
    "Why did the Christmas tree go to the barber? It needed a trim.",
    "What did the stamp say to the Christmas card? Stick with me and we'll go places!",
    "Why was the snowman looking through the carrots? He was picking his nose.",
    "What's the best Christmas present? A broken drum, you just can't beat it!",
    "How do snowmen get around? By riding an 'icicle.",
    "What do you call a shark that delivers toys at Christmas? Santa Jaws.",
    "What did the beaver say to the Christmas Tree? Nice gnawing you!",
    "What do you call Santa when he stops moving? Santa Pause.",
    "Why did Santa put a clock in his sleigh? He wanted to see time fly!",
    "What's green, covered in tinsel and goes ribbet ribbet? A Mistle-toad.",
    "What's Santa's favorite type of music? Wrap.",
    "What do you call a blind reindeer? No eye-deer.",
    "What did the sea Say to Santa? Nothing! It just waved.",
    "What kind of motorbike does Santa ride? A Holly Davidson!",
    "What do you get if Santa goes down the chimney when a fire is lit? Krisp Kringle.",
    "Who is Santa's favorite singer? Elf-is Presley.",
    "What's a parent's favorite Christmas carol? Silent Night.",
    "What do you call Father Christmas on the beach? Sandy Claus!",
    "What says 'Oh Oh Oh'? Santa walking backwards!",
    "Why are Christmas trees so bad at knitting? Because they always drop their needles!",
    "What do angry mice send to each other at Christmas? Cross-mouse cards!",
    "Why did the gingerbread man go to the doctor? Because he felt crummy.",
    "What carol is heard in the desert? O camel ye faithful.",
    "What's a ghost's favorite Christmas story? The Ghost of Christmas Passed.",
    "Why are Christmas trees so fond of the past? Because the present's beneath them!"
]